# Задача 4. Студент се явява на изпит с конспект от 20 въпроса. От тях не знае само 3 въпроса.
# На изпита си тегли 2 въпроса от конспекта.
# Каква е вероятността да знае само един от изтеглените въпроси?

sample.exam <- function() {
    # генерираме въпросите от изпита, тук незнаеш въпрос е 0, а знаещ въпрос е 1
    questions <- c(rep(0,3),  rep(1, 17))
    # взимаме 2 въпроса от изпита
    exam <- sample(questions, 2, replace=F)
    # за да сме изтеглили един от незнаещите и един знаеш, трябва събора да е 1
    sum(exam) == 1
}

prob.exam <- function(Nrep) {
    result <- replicate(Nrep, sample.exam())
    sum(result) / Nrep
}