# Задача 1. В кутия има 8 топки, номерирани от 1 до 8. Вадим произволна топка и я 
# връщаме в кутията. Отново вадим произволна топка. Каква е вероятността да извадим 
# два пъти една и съща топка?

sample_draw <- function() {
    # взимаме две произволно избрани топки
    draw1 <- sample(c(1:8), 1)
    draw2 <- sample(c(1:8), 1)

    # функцията ще върне true, ако двете топки са с равен индекс
    return(draw1 == draw2)
}

prob_draw <- function(Nrep) {
    # правим всичките Nrep опити на sample_draw()
    result <- replicate(Nrep, sample_draw())

    # събрани са всички успешни опити и се делят на броя на опити
    sum(result) / Nrep
}

prob_draw(1000)