# Задача 6. В отдел на фирма работят 20 човека. За Коледа те решават да си разменят подаръци. 
# В кутия слагат 20 листчета, на всяко от които има едно име. 
# Всеки тегли листче (без да го връща) и подарява на този, чието име е изтеглил. 
# Каква е вероятността поне един да изтегли своето име?

sim.gifts <- function(k) {
  # k на брой работника взимат k лисчета
  x <- sample( c(1:k), k, replace=F )
  # ако някой е взел листчето за себе си от разликата един елемент ще е 0
  d <- x - c(1:k)
  # проверката дали един елемент е нула
  any(d==0)
}

prob.gifts <- function(Nrep, k) {
  res <- replicate( Nrep, sim.gifts(k) )
  sum(res)/length(res)
}

prob.gifts(100000, 20)