# Задача 31. Теглим 10 пъти по една случайно избрана карта от тесте с 52 карти (с връщане). 
# Каква е вероятността да изтеглим поне 2 купи?

simple.hearts.take <- function() {

    # 0лите са останалите карти, а 1ците са купите
    deck <- c( rep(0,39), rep(1,13))

    # взимаме от цялото тесте 10 карти с връщане
    cardTakes <- sample(deck, 10, replace=T)

    # ако сме взели поне 2 купи ще върне true
    sum(cardTakes) >= 2
}

Nrep <- 1000
result <- replicate(Nrep, simple.hearts.take)

sum(result)/length(result)

# Другият начин за решаване, понеже шанса да изтеглим купа е 1/4 може да разгледаме всичко като биномно разпределение
# Така нека X да е броят на изтеглените купи, тогава от нас се иска P(X >= 2), а това ще се намери чрез 1 - P(X <= 1)
1 - pbinom(1, 10, 1/4)