# Тази задача се решава чрез z-тест за пропорция

# Как да знам, че една задача се решава чрез z-тест за пропорция
# 1) не търсим мярка по скала, а търсим брои на обекти, които са дефекти, или успехи
# 2) Оглеждай се в условието за проценти, вероятности, дял, част или някви подобни
# 3) Ако никъде не е дадено стандартното отклонение

# Задача Известно е, че при 10% от колите от дадена марка се появява сериозен
# дефект по време на гаранционния срок. От първите 25000 продадени коли от нов модел,
# 2700 се оказали с дефект. Може ли да се твърди, че вероятността в кола от новия модел да
# се появи дефект не е 10%?

n <- 25000
x <- 27000
p <- 0.1

# Тук първоначалната хипотеза е за 10% -> H0 e 10%
# Втората хипотеза при нас битат дали е различно от 10%, тоест H1 != H0

z.obs <- ((x/n) - p) / (sqrt(p*(1-p)*(1/n)))
pvalue <- 2*(1-pnorm(abs(z.obs))) 
# Не забравяй това е случая само ако H1 != H0, ако беше H1 > H0 формулата щеше да е друга
# така или иначе са същите като z-тест за средно виж задача55_0

# Тук pvalu-то е по-малко от 0.05 следователно отхвърляме нулевата хипотеза 