# Да се реши задача 76 от problems_v8.pdf

# Тази задача ще я решим чрез t тест

# Данните с които ще работим
x <- c(12.3, 11.2, 14.2, 15.3, 14.8, 13.5, 11.1, 15.1, 15.4, 13.2)
n <- 10

# а)

# Тази подточка се решава с t-тест за средно

# H0 = 14.6
# H1 != 14.6

mu <- 14.6 
z.value <- (mean(x) - mu)/(sd(x)/sqrt(n))
p.value <- 2*(1-pt(abs(z.value), n-1))
print(p.value)

# Тук > 0.05 имаме основанието да отхвърлим нулевата теза 

t.test( x, mu=14.6 ) # тази функцията също работи

# б)
# H0 = 14.6
# H1 < 14.6

mu <- 14.6 
z.value <- (mean(x) - mu)/(sd(x)/sqrt(n))
p.value <- pt(abs(z.value), n-1)
print(p.value)

t.test( x, mu=14.6, alternative="less" )