# Времето на чакане (в секунди) на асансьор в сграда е равномерно разпределено в интервала (0, 60).
# Ако засечем времето на чакане на 50 човека, каква е вероятността 
# полученото средно време да е между 25 и 35 секунди?

# Това ни е общият брой хора
n <- 50 

# Понеже данните тук са равномерно разпределени формулите за средна стойнсот (mu) и отклонение (sigma) ще бъдат различни

# формулата е (A + B) /2
mu <- (0 + 60) / 2

# формулата е (B - A) / sqrt(12)
sigma <- (60 - 0) / sqrt(12)

# Очакваното от нас е средната стойнсот да е > 25 и да е < 35
# Това лесно може да се намери като се стойността за <35 - <25

# Намиране на z оценката за различните величини
z.value35 <- (35 - 35) / (sigma / sqrt(n))
z.value25 <- (35 - 25) / (sigma / sqrt(n))

# Намиране на финалната вероятност
z.value35 - z.value25