# Регистрираният багаж на пътниците в даден самолет не трябва да надвишава общо 4000 кг.
# Количеството регистриран багаж на произволно избран пътник е случайна величина със средно 24 кг и стандартно отклонение 7 кг.
# Каква е вероятността общото количество регистриран багаж в самолет със 160 пътници да надвиши 4000 кг?

# В тази задача се търси сума на случайни величини, а тук има няколко подробности

mu <- 24 
sigma <- 7
n <- 160 

# Очакваната обща сума ще бъде 160*24, защо имаме 160 пътника и средно 24 кг

z.value <- (4000-160*24)/(sqrt(160)*7)
# Не забравяй pnorm(z.value) ще ни върне случая, в който няма да надвиши, но ние търсим обратното събитие
1 - pnorm(z.value)