# Решаваме задача 67 от problems_v8.pdf

# Нека имаме X, което е броят на стафиди в една кифла

# дадените ни задачи от таблицата
x <- c(4:7)
p <- c(0.2, 0.4, 0.3, 0.1)

# Извадката 
n <- 49

# Това е очакваната средна стойност
mu <- sum(x*p)

# Отклонението се смята по различен начин, когато имаме дисректни величини
# Следното е формула затова го запомни 
sigma <- sqrt( sum(x^2)*p - mu^2 )

# Тук сега ще намерим стойността на z
z.value <- (5.5 - mu) / (sigma/sqrt(n))

# Понеже pnorm(z.value) ще ни намери средната стойност за <= 5.5, а ние искаме обратното събитие
1 - pnorm(z.value)