# Това е задача 65 от problems_v8.pdf

# Тази задача ще я решим чрез ЦГМ (Централна граничена теорема)
# Тя гласи, че ако имаме достатъчно голям брой независими случайни величини тяхната сума
# ще има приблизително нормално разпределение 
# Това важи НЕЗАВИСИМО от това какво е било първоначалното разпределение на даннтие 

# Кога да се използва тази теорема?
# Търси се вероятност за СРЕДНО АРИТМЕТИЧНО или СУМА 
# Ако извадката е прекалено голяма (n >= 30)
# Оригиналното разпределение НЕ е нормално 

# Как да я използваме към нашата задача?
# Търсим очакваното средно (mu) и стандарното отклоненеи (sigma)
# Определяме размера на извадката
# Изчисляваме "стандартната грешка", а това е sigma/sqrt(n)

# Сега ще сметнем Z-оцена, а това е търсенто от нас в задачата (примерно 980 както е в задачата) - mu и всичко това делено на sigma/sqrt(n)

# Това знаем, че е средната стойност
mu <- 900
# (в някой задачи може да ни е даден параметъра lambda за интензитивност, и средната стойност се намира по 1/lambda)

# Това е номера на извадката
n <- 100

# Това е стандарното отклонение (това е формулата само за експоненциално разпределение)
sigma <- 900
# sigma се намира чрез формулата 1/lambda отново

# Търсеното в условието
newValue <- 980

# Изчисляване на Z ocenka
z <- (980-900)/(sigma/sqrt(n)) 

# Това ще ни е финалната вероятност, която се търси от нас
# pnorm(z) винаги пресмята вероятността стойността да е по-малка или равна на z, а ние търсим z > 980
1 - pnorm(z) 