# Задача 10. Авиокомпания е продала 143 билета за самолет, в който има 138 пътнически места. 
# Вероятността пътник да дойде навреме за полета си е 0.92. 
# Нека приемем, че даден пътник идва навреме независимо от останалите пътници.
# а) Каква е вероятността да има място за всички пътници, които са дошли навреме?
# б) Каква е вероятността да остане едно незаето пътническо място?

simple.ticket <- function() {
    # всеки път или ще успее (1) или няма да успее(0)
    # като за успех има вероятност от 92%, а за да не успее има вероятност от 0.08 процента
    allPassenger <- sample(c(0,1), 143, replace=T, prob=c(0.08, 0.92))
    # събираме всички пътници
    sum(allPassenger)
}

res <- replicate(1000, simple.ticket())

sum(res <= 138) / length(res)
sum(res == 137) / length(res)