# Тази задача ще ти обясни как работи z-test за средно

# Как да разбереш дали една задача да я решаваш с z-тест за средно
# Ако в условието на задачата ти е дадена отклонение/дисперсия на множество => използваш Z-тест
# Ако в условието на задачата ти е дадена голяма извадка n>30 => пак използваш Z–тест 

# Задача. Фирма произвежда електрически крушки. Средното време на живот на една
# крушка е 2000 часа със стандартно отклонение 300 часа. Предложен е нов тип крушки.
# Изпробвани са 100 крушки от новия тип. Резултатите показват средно време на живот
# на новите крушки 2100 часа и същото стандартно отклонение. Може ли да се твърди, че
# средното време на живот на новия тип крушки е повече от 2000 часа?

# Това е нулевата хипотеза, тоест очакваното ппц
H0 <- 2000

# това е отклонението в задачата
sigma <- 300

# Имаме 100 нови круши от новия тип
n <- 100

# Това е средната стойност за крушките от новият тип 
H1 <- 2100 

# Трябва да проверим дали средният време на новите крушки е повееч от предишното
# това пак е формула в статистиката, която се изпозлзва за z-test за средно
z.obs <- (H1 - H0) / (sigma / sqrt(n))

# Понеже от нас се търси дали ще бъде изпълнено H1 > H0, ще бъде изпълнено
pvalue <- 1 - pnorm(z.obs) # това е правило в статистиката !!!!
print(pvalue)

# Ако търсехме H1 < HO щеше да е само pnorm(z.obs)
# Aко търсехме H1 == H0 щеше да е 2*(1-pnorm(abs(z.obs)))

# Понеже pvalue <= 0.5 тогава отхвърляме нулевата хипотеза в полза на новата
# Това с pvalue <= 0.5 е просто фиксирано в статистиката, ако примерно pvalue > 0.5 щяхме да отхвърлим новата хипотеза
# и щяхме да си 