# Задача 28. За клинично проучване са необходими доброволци, имащи определен ген, който се среща с вероятност 1/10.
# а) Каква е вероятността да се тестват 5 или повече доброволци докато се намери първия доброволец с въпросния ген?
# б) Каква е вероятността да се тестват 50 или повече доброволци докато се намерят 10 доброволци с въпросния ген?

# а)
# X е броят на тествани доброволци преди да се срещне този ген, тоест от нас се търси P(X >= 4), а това оже да се намери с 1 - P(X <= 3)
# В условието поне 5 доброволеца да се тестват, тоест на 5тия ще имаме нашият ген и ние търсим кога X може да е по-голяма от 4ри
1 - pgeom(3, 1/10)

# б)
1 - pnbinom(39, 10, 1/10)
