# Задача 26. В партида от 100 батерии има 3 дефектни. Избрани са 50 батерии за проверка.
# Каква е вероятността измежду избраните да има поне 2 дефектни?

# Ако X броят на изтеглените дефекти батерии, като в задачата се търси P(X >= 2), а това може да се намери чрез 1 - P(X <= 1)

# Тук първият аргумент е каква стойност трябва да има X 
# Вторият елемент е "проблемнните" батерии
# Третия аргумент е останалите правилни батерии
# Четвъртия аргумент е колко теглим от общата (100 батерии) бройка
1 - phyper(1, 3, 97, 50)