# Задача 8. В кутия има 6 сурови и 2 сварени яйца. Двама играчи, редувайки се, избират яйце докато извадят всички яйца. 
# Намерете вероятностите на следните събития:
# A = {на един играч се падат двете сварени яйца};
# B = {пада се по едно сварено яйце на всеки играч};
# C = {падат се двете сварени яйца на този, който тегли първи};
# D = {падат се двете сварени яйца на този, който тегли втори}.

sim.eggs <- function() {

  # генерираме всички яйца, тези които са вери са с b, а тези които са сурови са с r
  eggs <- c( rep("b", 2), rep("r", 6) )
  # генерираме на всеки ход, кои какво е изтеглил
  draws <- sample( eggs, 8, replace=F )
  # понеже той е първи той тегли на ходове 1,3,5,7
  player1 <- draws[seq(1,7,2)]
  # понеже той е втори той тегли на ходове 2,4,6,8
  player2 <- draws[seq(2,8,2)]
  # смята брой на сварени айца на втория играч
  b1 <- sum(player1=="b")
  # смята броя на сурови яйца на втория играч 
  b2 <- sum(player2=="b")

  # резултата се запазва тука
  c(b1, b2)
}

Nrep <- 100000
res <- replicate( Nrep, sim.eggs() )
res[,1:10]

# смятане на вероятността на събитие A
( sum(res[1,]==2) + sum(res[2,]==2) ) / Nrep

# смятане на вероятността на събитие B
sum(res[1,]==1) / Nrep
sum(res[2,]==1) / Nrep

# смятане на вероятността на събитие C
sum(res[1,]==2) / Nrep

# смятане на вероятността на събитие D
sum(res[2,]==2) / Nrep

