# Задача 11. В една кутия има 2 зелени и 2 червени топки. В друга кутия има 1 зелена и 4 червени топки. 
# Хвърляме зар и ако се падне шестица, теглим топка от първата кутия, 
# а ако не се падне шестица, теглим топка от втората кутия.
# а) Каква е вероятността да извадим зелена топка?
# б) Ако извадената топка е зелена, каква е вероятността да е извадена от втората кутия?

sim.dice.a <- function() {

    # правим хвърлянето на зара
    diceThrown <- sample(c(1:6), 1)

    # първи случай, ако сме хвърлили 6 взимаме от първата кутия
    # тука зелените топки са 1, а червените са 0
    if(diceThrown==6) {
        ball <- sample(c(1,1,0,0), 1)
    } else {
        # в противен случай се взима от втората кутия
        ball <- sample(c(0,0,0,0,1), 1)
    }

    # ако се е паднала зелена връщаме true
    ball==1
}

Nrep <- 1000

res <- replicate(Nrep, sim.dice.a())
sum(res)/Nrep

sim.dice.b <- function() {
    dice <- sample( c(1:6), 1 )
    if (dice==6) {
        ball <- sample( c("g", "g", "r", "r"), 1 )
    } else {
        ball <- sample( c("g", "r", "r", "r", "r"), 1 )
    }

    # тук връщаме зара и от коя кутия сме взели
    c(dice, ball)
}

res <- replicate(Nrep, sum.dice.b())
# тук благоприятните случай са ако не сме хвърлили 6 обаче пак сме изтеглили зелена топка
sum(res[1,]!=6 & res[2,]==1) / Nrep