# Задача 14. 
# В кутия има 99 топки, номерирани от 1 до 99. 
# Теглим без връщане 4 случайно избрани топки. 
# Каква е вероятността първата извадена топка да е с 
# най-голям номер от извадените 4 топки?

simple.take.four.balls <- function() {

    # номерираме всички топки
    balls <- c(1:99)

    # взимаме 4ри от тези топки
    takenBalls <- sample(balls, 4, replace=F)

    # най-голямата топка е реално тази, която е макс от всичките
    takenBalls[1]==max(takenBalls)
}

Nrep <- 10000
result <- replicate(Nrep, simple.take.four.balls())