# Задача 18. Хвърляме зар 10 пъти.
# 
# Тук използваме биномно разпределение (Binomial Distribution), 
# тъй като имаме фиксиран брой независими опити (n=10) 
# и фиксирана вероятност за успех (падане на шестица, p=1/6).
#
# а) Каква е вероятността да се паднат точно 2 шестици?
# б) Каква е вероятността да се паднат не повече от 2 шестици?
# в) Каква е вероятността да се паднат 2 или повече шестици?
# г) Каква е вероятността да се паднат между 3 и 8 шестици?

# а)
dbinom(2,10,1/6)
# Търсим двата успешни опита 2 от общо 10 хвърляние и с вероятност за 6ца да е 1/6

# б)
pbinom(2,10,1/6)
# Търсим каква е вероятността да имаме по малко от 2 успешни опита
# това може да се намери и чрез
dbinom(0,10,1/6) + dbinom(1,10,1/6) + dbinom(2,10,1/6)

# в)
# Идеята тук е да търсим P(X >= 2), а тoва може да се намери и чрез 1 - P(X >= 1)
1 - pbinom(1,10,1/6)

# г)
# Търси се с P(3 <= X <= 8) = сумата на всичките P(X=3) + ... + P(X=8)
dbinom(3,10,1/6) + dbinom(4,10,1/6) + dbinom(5,10,1/6) + dbinom(6,10,1/6) + dbinom(7,10,1/6) + dbinom(8,10,1/6) 


