
# Задача 32. Генерирайте 500 случайни числа от равномерно разпределение в интервала (3, 5).
# Начертайте хистограма на генерираните числа и на същата картинка добавете графика на плътността на случайна величина X ~ U(3, 5). 
# Повторете същото с 5000 случайни числа.

# Генерираме 5000 числа между 3 и 5 
x1 <- runif(5000, 3, 5)
# чертаем христограмата
hist(x1, probability=T)
# тук добавяме плътността, като посочваме чрез dunif(x,3,5) и посочваме range-a
curve( dunif(x, 3, 5), from=3, to=5, add=T, lwd=2 )