# Тази задача се решава чрез t-тест за средно

# Как да разберем, че една такава задача се решава чрез t-тест
# 1) Нямаме отклонение
# 2) Имаме малък на брой задачи

# Задача. Според исторически данни, средната киселинност на дъждовете в определен
# индустриален район е 5.2. За да се провери има ли изменение в тази стойност е измерена
# киселинността на 12 валежа през изминалата година. Получени са следните резултати:
#
# 6.1  5.4  4.8  5.8  6.6  5.3  6.1  4.4  3.9  6.8  6.5  6.3
#
# От предишни изследвания е известно, че киселинността на валежите има нормално раз-
# пределение. Имаме ли основания да твърдим, че киселинността в района се е променила в
# сравнение с историческите данни.

H0 <- 5.2
n <- 12
x <- c(6.1, 5.4, 5.8, 6.6, 5.3, 6.1, 4.4, 3.9, 6.8, 6.5, 6.3)

# Така се намира тази t стойност за средно
t.obs <- (mean(x) - H0) / (sd(x)/sqrt(n))

# Търси се дали H1 е != от H0
p.value <- 2*(1-pt(abs(t.obs), n-1))

# Понеже стойността на p.value > 0.05 нямаме достатъчно основания да отхвърлим нулевата хипотеза



