# Задача 23. На студенти е даден тест от 10 въпроса, всеки с по 4 възможни отговора, 
# един от които е верен. Иван се явява на теста без да е учил и огражда произволно отговори. 
# Каква е вероятността да е отговорил вярно на поне 5 от въпросите?

# X ще бъде броя на правилно отговорени въпроси от Иван
# От нас се търси P(X <= 5)

# Това е събора на всичките възможни стойности за X = {0,1,2,3,4,5}
sum( dbinom((0:5), 10, 1/4) )

# Противен случай може да бъде, 1 - P(X <= 4) 
1 - pbinom(4, 10, 1/4)