# Задача 38. Количеството (в мл) на портокалов сок в случайно избрана бутилка, произведена от дадена компания, е случайна величина, която има равномерно разпределение в интервала (495, 502).
# а) Намерете вероятността в случайно избрана бутилка да има повече от 500 мл сок.
# б) Нека v е такова, че с вероятност 0.8 в случайно избрана бутилка има поне v мл сок.
# Намерете стойността на v.

# а) Нека X е стойността на налятите милилитри, тогава се търси P(X > 500), което може да е 1 - P(X <= 500)
1 - punif(500, 495, 502)

# б) 
# Ако на нас са ни дали вероятността и трябва да търсим дадена стойност трябва да използваме формулите, които почват с q
# Нека X е колко процента сок има в бутилката и ние е дадено че P(X > v) = 0.8, това означава че P(X <= v) e 1 - P(X > v) = 0.2
# Тази фунцкия, ще намери колко е границата на тези бутилки, които реално имат 0.2 процента напълнинени 
qunif(0.2, 495, 502)
