# Задача 29. Средно веднъж на 90 дни в софийското метро възниква технически проблем, който води до спиране на движението на влаковете за поне 20 минути. 
# Каква е вероятността за 360 дни да възникне такъв проблем повече от 3 пъти?

# Параметъра ламбда се намира по следния начин: средният брой събития за една единица време * дължината на интервала, за която търсим
# ако направим нашите сметки: имаме 1/90 шанс да се случи технически проблем и търсим интервала от 360 дни, тогава 1/90 * 360 = 4

n -> 360
p -> 1/90

# Нека X да е броя проблеми възникнали, от нас се търси вероятността за P(X > 3), а това може да се намери чрез 1 - P(X <= 3)
1 - ppois(3, n *p)
