# Това е задача 70 от problems_v8.pdf

# Тази задача я решаваме чрез z-тест с пропорции

# H0: p = 1/2
# H1: p > 1/2

n <- 100 # това са хвърлянията на монетата
x <- 58 # това е броят успехи, тоест паданията на ези
p <- 1/2 # това е хипотетичната пропорция, тоест възможността да се падне ези да е повече от 1/2

# Смятаме стойността 
z.obs <- (x/n - p) / sqrt(p * (1-p)/n)
# Спореед мен просто трябва да я запомниш тази теорема

# Използваме тази сметка за p.value понеже се търси H1 > H0 
p.value <- 1 - pnorm(z.obs)
print(p.value)

# Тук p.value е 0.058 > 0.05
# Понеже стойността е по-голяма от 0.5 може да се каже, че нямаме основание да отхвърлим нулевата хипотеза


