# Тази задача е базирана задача 68 от problems_v8.pdf

# Тази задача се решава чрез Централна гранична теорема

n <- 160 # брой пътници това е размера на извадката
mu <- 24 # това е средното тегло на багажа
sigma <- 7 # отклонението
max <- 4000

# Тук използваме Централна гранична теорема
a <- (4000 - n*lambda)/(sigma*sqrt(n))
1 - pnorm(a)

# Това го използваш само като потенциално имаш нормално разпределение
# Аз самата формула не я разбрах, но го запомни така
# От търсеното число изважда броя n даден задачата по средната стойност
# след това правиш деление на отклонението по квадрат на всичките стойности n