# Задача 13.
# Имаме 3 карти:
# - карта 1: бяла от двете страни;
# - карта 2: черна от двете страни;
# - карта 3: бяла от едната и черна от другата страна.
#
# Всяка карта е поставена в затворена кутия.
# Избираме произволна кутия, отваряме я и виждаме, че горната страна 
# на картата в нея е бяла.
#
# Въпрос: Каква е вероятността другата страна на картата също да е бяла?

simple.cardTake <- function() {

    # всичките наши карти, които имаме
    cards <- c("11", "22", "12")

    # избираме картата и страната, която ще се падне
    pickedCard <- sample(cards, 1, replace=F)
    side <- sample(c(1,2), 1)

    # взимаме от картата страната, която се е паднала
    # пример: ако се е паднало pickedCard="11" и side=1, тогава upSide ще е 1
    upSide <- substr(pickedCard, start=side, stop=side)

    # връщаме какво се е паднало
    c(upSide, pickedCard)
}

Nrep <- 10000
result <- replicate(Nrep, simple.cardTake())
print(sum(result[1,]=="1" & result[2,]=="12") / sum(result[1,]=="1"))