# Задача 35. За n = 200 и n = 1000 генерирайте данни x_1, x_2, ..., x_n от равномерно разпределение в интервала (7, 9).
# Начертайте емпиричната функция на разпределение на данните. На същата картинка добавете функцията на разпределение на случайна величина
# X ~ U(7, 9).

# броя на данни, които искам да работим
n <- 200
# n <- 1000

# генерира n на брой случайни числа, които са равномерно разпределени
x <- runif(n, 7, 9)
# тази функция чертае емпиричната функция на разпределението
plot.ecdf(x, do.points=F)
# фунцкия за чертаене на непрекъснати математически криви
curve( punif(x, 7, 9), add=T, col="red" ) 

