# Виж задача 9.2 от vs_pr_notes_20251211.pdf

# Тази задача се решава чрез t-test за разлика на средни: зависими извадки

# t-test се използва, когато искаме да сравним средните стойности на две групи, като тези стойности са зависими една от друга

# От условието имаме H0 
# Обаче можем да проверим хипотезата за H1, която ни пита дали нещо е повече

# Това са резултатите от преди
x <- c(265,240,258,295,251,245,287,314,260,279,283,240,238,225,247)

# Това са резултатите от след 
y <- c(229,231,227,240,238,241,234,256,247,239,246,218,219,226,233)

# Това е нужно, защото е част от t стойността
d <- x - y

n <- length(x)

t.obs <- mean(d) / (sd(d)/sqrt(n))

p.value <- 1-pt(t.obs, n-1)

# Може и с тази формула да се реши 
t.test(x,y, alt="greater", paired=T)