# Мениджър обмисля въвеждане на допълнителна 15-минутна почивка за работниците си.
# За да разбере дали такава почивка ще намали броя на грешките, които правят работниците, избрал случайно 2 групи по 10 души.
# Първата група имала допълнителна почивка, а втората работила по обичайното работно време.
# Данните за броя на допуснатите грешки от двете групи са следните:
#
# Група 1:  8, 7, 5, 8, 10, 9, 7, 8, 4, 5
# Група 2:  7, 6, 14, 12, 13, 8, 9, 6, 10, 9
#
# Приемаме, че данните са приблизително нормално разпределени.
# Може ли да се заключи, че работниците с допълнителна почивка правят средно по-малко грешки?

# Тази задача се решава с t-тест за разлика на среди 

# Как да разбереш, че една задача се решава така
# 1) Търсим разлика в средни стойности
# 2) Имаме две групи и извадката е нзавсима 
# 3) Данните са нормално разпределени
# 4) Отклонението не е ясно

# H0, тук се пита дали ще имат едни и същи грешки
# H1, хипотезата е дали работниците с продължителната повичка правят средно по-малко грешки

x <- c(8,7,5,8,10,9,7,8,4,5)
y <- c(7,6,14,12,13,8,9,6,10,9)

n <- length(x)
m <- length(y)

# Пресмятаме тази T стойност
t.obs <- (mean(x) - mean(y)) / sqrt( var(x)/n  + var(y)/m )

# Понеже данните на групите работници са нормално разпределени (пише в условието) трябва да направим тази сметка
df <- ( var(x)/n + var(y)/m )^2 / ( ((var(x)/n)^2)/(n-1) + ((var(y)/m)^2)/(m-1))

# Накрая смятаме p.value
p.value <- pt(t.obs, df)

print(p.value)

# Стойността е < 0.5 следователно имаме основание да отхвърлим H0 в полза на H1