# В проучване участвали 220 жени и 210 мъже.
# Според резултатите, 71 жени и 58 мъже отговорили, че предпочитат безкофеиново кафе.
# Може ли да твърдим, че процентът на жените, предпочитащи безкофеиново кафе, е различен от процентът на мъжете, предпочитащи безкофеиново кафе?

# Тази задача се решава с z-тест за разлика на пропорции

# Имаме Хипотезата H0 p1=p2
# Другата хипотеза е H1 p1!=p2

# Брой жени направили резултатите
x <- (71, 58)

# Общ брой жени
n <- (220, 210)

# Това е задълже да се направи, част от формулата е
p.hat <- (x[1] + x[2]) / (n[1] + n[2])

z.obs <- (x[1]/n[1] - x[2]/n[2]) / sqrt( p.hat*(1-p.hat)*(1/n[1] + 1/n[2]))

p.value <- 2*(1-pnorm(abs(z.obs)))

# Работи също и 
prop.test(x,n,correct=F)