# Виж условието на задача 80 от problems_v8.pdf

# Тук използваме z-test за разлика на две пропорции

# Улики че тази задача се решава с z-test за разлика на две пропорции
# Даннтие са категорични, тоест те са да или не
# Има доста голяма извадка

# Хi е оценката на i–тия студент с Вариант А
# Yj е оценката на j-тия студент с Вариант В
# mu_Y = е средната оцена при падането на ваирант Б
# mu_X = е средната оценка при падането на варинат А

# Имаме хипотеза H0 : mu_X = mu_Y
# Имаме хипотеза H1: mu_X > mu_Y

examAB <- read.table("examAB.txt", header=T)
x <- examAB$points[examAB$variant="A"]
y <- examAB$points[examAB$variant="B"]

t.text(x,y,alternative="greater")

# Резултата е 0.01 < 0.05
# Следователно отвхърляме нулевата хипотеза в полза на алтернативата 