# Погледни условието на задача 81. от Problems_v8.pdf

# Тази задача ще се решава с t-тест за разлика на средно

# Х_i е времето на реакция на i тия участник преди изпиване на 50мл водка 
# Y_i е времето на реакция на i тия участник след изпиването на 50мл водка 
# mu_X е средно време на реакция преди изпиване на 50мл водка
# mu_Y е средно време на реакция след изпиването на 50мл водка

# H0: mu_X = mu_Y
# H1: mu_X < mu_Y

reactTime <- read.table("reacttime.txt")

x <- reactTime$before
y <- reactTime$after

t.test(x,y,alternative="less", paired=T)