# Задача 40. Количеството (в кг) кашкавал, което се изразходва в дадена пицария за една седмица, е нормално разпределено с параметри μ = 41, σ = 5.
# а) Каква е вероятността в произволно избрана седмица пицарията да изразходи над 51 кг кашкавал?
# б) Каква е вероятността в произволно избрана седмица пицарията да изразходи между 45 и 50 кг кашкавал?
# в) Колко кашкавал трябва да има в запас в дадена седмица, така че да е достатъчно с вероятност 0.99?

# a)
# Нека да имаме X, което е кг изразходени кашкавали, от нас се търси P(X > 51), а това може да се намери като 1 - P(X <= 51)
1 - pnorm(51, 41, 5)

# б)
# Нека отново X да е изразходеният кашкавал, от нас се търси P(45 < X < 50), a това може да се намери чрез P(X=50) - P(X=45)
# точно това ще включва търсените от нас вероятности
pnorm(50, 41, 5) - pnorm(45, 41, 5)

# в)
# Отново имаме дадена вероятност, така търсим P(X <= t) = 0.99
qnorm(0.99, 41, 5)