# Задача 33. Генерирайте 500 случайни числа от експоненциално разпределение с параметър lambda = 1/7.
# Начертайте хистограма на генерираните числа и на същата картинка добавете графика на плътността на случайна величина X ~ Exp(lambda = 1/7).
# Повторете същото с 5000 случайни числа.

# правене на random числата
ex <- rexp(5000, 1/7)
# подготовка за чертаене на графата
hist(ex, probability=T)
# тук dexp се използва, за да се чертае графиката
curve( dexp(x, 1/7), from=0, to=max(ex), add=T, lwd=2 )