# Задача 21. Фенерче работи с 2 батерии. Иван има 8 батерии, от които 5 са нови и 3
# са изтощени, но не знае кои точно. Ако пробва с 2 случайно избрани батерии, каква е
# вероятността фенерчето да не заработи?

# Нека X да бъде "броят на взетите работещи батерии", тоест може да се разглежда като успехите на взимане на работещата батерия
# Х може да има стойностите 0, 1, 2 

# От нас се търси каква е вероятността P(x<2) а това е равно на P(X=0) и P(X=2)

# Първият аргумент е успехите, които ни интересуват
# Вторият аргумент е успешните елементи
# Третия аргумент е неуспешните елементи
# Четвъртият аргумент е колко елемента теглим 
dhyper(0, 5, 3, 2) + dhyper(1, 5, 3, 2)
