# Задача 22. Машинописка прави средно по една грешка на всеки 500 думи. На една
# страница има 300 думи.
# а) Каква е вероятността да направи не повече от 2 грешки на 5 страници?
# б) Каква е вероятността да направи между 1 и 3 грешки (включително) на 5 страници?

# 5 страници са 1500 думи
# Вероятността за грешка е 1/500 като 500 е броя думи
n <- 1500
p <- 1/500

# a)
# X - броя натикани грешки за тези 1500 думи
# Може да разглеждаме това като успехи

# P(X <= 2)
pbinom(2, n, p)

# Тук се използва поасоново разпределение, тук имаме средно по 500 думи да имаме по 1 грешка, следователно за 1500 думи средно ще имаме 3 грешки
ppois(2, n*p)


# б)
# Тук се търси P(1 <= X <= 3) = P(X=1) + P(X=2) + P(X=3) за 5 страници (тоест 1500 думи)

dbinom(1, n, p) + dbinom(2, n, p) + dbinom (3,n,p)
# Това също би било работило
dbinom(3, n, p) - dbinom(0, n, p) 