# Задача 36. За n = 200 и n = 1000 генерирайте данни x_1, x_2, ..., x_n от експоненциално разпределение с параметър lambda = 3.
# Начертайте емпиричната функция на разпределение нa данните.
# На същата картинка добавете функцията на разпределение на случайна величина
# X ~ Exp(lambda = 3).

# Важно!!! когато видим в условието на задачата фунцкия на разпределение това ознаачава че търсим да начертаем чрез pexp

n <- 1000

# генерира n на брой случайни числа, които са равномерно разпределени
x <- rexp(n, 3)
# чертаем графиката за функция на разпределение
plot.ecdf(x, do.points=F)
curve(pexp(x,3), add=T, col="red")