# Задача 48.
# Времето от зареждане до изтощаване на батерия на лаптоп при обичайна работа е нормално разпределено със средно 260 минути и стандартно отклонение 50 минути.
# Каква е вероятността батерия да се изтощи след повече от 4 часа работа?
# Каква е вероятността батерия да се изтощи след между 3 и 5 часа работа?
# Намерете t, такова че батерия се изтощава след повече от t минути с вероятност 0.9.

mu <- 260 # а това е 4
sigma <- 50 

# a)
# Нека X да е броя минути преди да се изтощи, от нас се търси P(X > 240), а това може да се намери чрез 1 - P(X <= 240)
1 - pnorm(240, mu, sigma)

# б)
# Нека Х да е същата величина, от нас се търси P(180 < X < 300), a това може да се намери чрез P(X = 300) - P(X = 180)
pnorm(300, mu, sigma) - pnorm(180, mu, sigma)

# в)
# Нека сега да имаме t, P(X > t) = 0.9, следователно P(X <= t) = 0.1
qnorm(0.1, mu, sigma)
