# Задача 39. Времето (в години) до повреда на пералня от даден модел е случайна величина X, която има експоненциално разпределение с параметър lambda = 1/4.
# а) Намерете вероятността пералня от този модел да не се повреди през първите 3 години.
# б) Намерете вероятността пералня от този модел да се повреди през първите 2 години.
# в) Ако пералня е работила без повреда 3 години, каква е вероятността да работи без повреда още 3 години?
# г) Намерете t, за което P(X <= t) = 0.90.

# a)
# Нека X е години до които една пералня няма повреда, търси се от нас P(X > 3), а то може да се намери чрез 1 - P(X <= 3)
1 - pexp(3, 1/4)

# б)
# Х e отново същата величина, търси се от нас да намерим P(X <= 2)
pexp(2, 1/4)

# в)
# Това условие мирише на условна вероятност, защото се търси това P(X > 6 | X > 3)
# Тази условна вероятност е равна на P(X > 6 | X > 3) = P(X > 6 И X > 3) / P(X > 3)
# Понеже е логично че ако една пералня е издъжала 6 години, то тя е издържала и 3
# Следователно P(X > 6 | X > 3) = P(X > 6) / P( X > 3)
(1 - pexp(6, 1/4)) / (1 - pexp(3,1/4))


# г)
# Тук отново имаме дадена вероятност и търсим стойност, значи трябва да използваме функцията, която почва с q
qexp(0.9, 1.4)